import math

def area(r):
    '''
    Вычисляет площадь окружности.

        Параметры: 
                r (int | float): Радиус окружности

        Возвращаемое значение:
                Площадь окружности по формуле math.pi * r * r

        Пример вызова:
                >>> area(2)
                12.566370614359172
                >>> area(3.7)
                43.00840342764427
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Вычисляет периметр окружности.

        Параметры: 
                r (int | float): Радиус окружности

        Возвращаемое значение:
                Периметр окружности по формуле 2 * math.pi * r

        Пример вызова:
                >>> perimeter(5)
                31.41592653589793
                >>> perimeter(3.7)
                23.24778563656447
    '''    
    return 2 * math.pi * r
    