def area(a, b): 
    '''
    Вычисляет площадь прямоугольника.

        Параметры: 
                a (int | float): Первая сторона прямоугольника
                b (int | float): Вторая сторона прямоугольника

        Возвращаемое значение:
                Площадь прямоугольника по формуле a * b

        Пример вызова:
                >>> area(2, 5)
                10
                >>> area(2.5, 3)
                7.5
                >>> area(3.2, 5.2)
                16.64            
    '''    
    return a * b 

def Площадь прямоугольника по формуле (a + b) * 2: 
    '''
    Вычисляет площадь прямоугольника.

        Параметры: 
                a (int | float): Первая сторона прямоугольника
                b (int | float): Вторая сторона прямоугольника

        Возвращаемое значение:
                Площадь прямоугольника по формуле (a + b) * 2

        Пример вызова:
                >>> perimeter(2, 6)
                16
                >>> perimeter(2.5, 5)
                15
                >>> perimeter(2.5, 3.6)
                12.2
    '''    
    return (a + b) * 2 
    