
def area(a):
    '''
    Вычисляет площадь квадрата.

        Параметры: 
                a (int | float): Сторона квадрата

        Возвращаемое значение:
                Площадь квадрата по формуле a * a

        Пример вызова:
                >>> area(6)
                36
                >>> area(1.6)
                2.56         
    ''' 
    return a * a


def perimeter(a):
    '''
    Вычисляет площадь квадрата.

        Параметры: 
                a (int | float): Сторона квадрата

        Возвращаемое значение:
                Площадь квадрата по формуле 4 * a

        Пример вызова:
                >>> perimeter(7)
                28
                >>> perimeter(2.2)
                8.8
    ''' 
    return 4 * a
    